#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-3tTtRqQ2y8LYPt5V

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
aws_key_pair.personal: Refreshing state... [id=personal]
aws_vpc.main: Refreshing state... [id=vpc-0840b0733c96900ff]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.root: Refreshing state... [id=126395676]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]
aws_subnet.main: Refreshing state... [id=subnet-07b920fcb5af96614]
aws_security_group.allow_inbound_ssh: Refreshing state... [id=sg-0735bd8de7ebd28ec]
aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2666256247]
aws_instance.main: Refreshing state... [id=i-00e1c97632b63217f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.main has changed
  ~ resource "aws_instance" "main" {
        id                                   = "i-00e1c97632b63217f"
      + tags                                 = {}
        # (28 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_security_group.allow_inbound_ssh has changed
  ~ resource "aws_security_group" "allow_inbound_ssh" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0735bd8de7ebd28ec"
        name                   = "inbound-ssh"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name" = "main"
        }
      + vpc_id   = "vpc-0840b0733c96900ff"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>